export const skills = [
  {
    id: 'skills-1',
    name: 'Javascript',
    des: [
      'ES6를 이해하고 있습니다.',
      'JS 기반의 라이브러리와 프레임워크를 사용할 수 있습니다.',
      '다양한 자료구조를 직접 구현하여 알고리즘 문제를 풀이할 수 있습니다.',
    ],
  },
  {
    id: 'skills-2',
    name: 'React',
    des: [
      '라이프 사이클을 이해하고 있습니다.',
      '작은 프로젝트의 프론트엔드를혼자 맡아 진행할 수 있습니다.',
      '컴포넌트의 개념을 이해하고 재사용성이 좋은 컴포넌트를 작성할 수 있습니다.',
    ],
  },
  {
    id: 'skills-3',
    name: 'Typescript',
    des: [
      'Type-safe한 코드를 코드를 작성할 수 있습니다.',
      '인터페이스를 통해 데이터 형식을 지정하여 클라이언트 내에서 데이터가 오가거나 서버와 데이터를 주고받을 때 실수를 줄이며 개발할수 있습니다.',
      '제네릭을 이해하며 이를 통해 재사용 가능한 코드를 작성할 수 있습니다.',
      '자동완성을 통해 더 빠른 개발이 가능합니다.',
    ],
  },
  {
    id: 'skills-4',
    name: 'Redux',
    des: [
      '클라이언트 단에서 발생한 데이터나, 서버에서 가져온 데이터를 전역적이고 체계적으로 관리할 수 있습니다.',
      '다양한 상태관리 라이브러리들의 장단점을 이해하고 프로젝트의 상황에 맞게 적용할 수 있습니다.',
    ],
  },
  {
    id: 'skills-',
    name: '',
    des: ['', '', ''],
  },
  {
    id: 'skills-',
    name: '',
    des: ['', '', ''],
  },
  {
    id: 'skills-',
    name: '',
    des: ['', '', ''],
  },
  {
    id: 'skills-',
    name: '',
    des: ['', '', ''],
  },
];

